Tekla Open API Reference for Tekla Structures 2025
Revision Properties
The ReferenceModel.Revision type exposes the following members.
Properties
Name | Description
FileName
 Gets the revision file name.
Hash
 Gets the revision hash identifier.
Id
 Gets the revision id.
IsCurrentRevision
 Gets the value indicating whether this revision is the current revision or not.
ReferenceModelId
 Gets or sets the parent reference model id.
Time
 Gets the revision time.
Top
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace